## Install "brew bundle" ##

# Install all the basic requirements
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"


# Packages
brew "ansible"
brew "antidote"
brew "argon2"
brew "asciiquarium"
brew "brotli"
brew "chezmoi"
brew "cmake"
brew "cowsay"
brew "easy-rsa"
brew "exa"
brew "fasd"
brew "fish"
brew "gh"
brew "htop"
brew "lazygit"
brew "lynx"
brew "maven"
brew "mitmproxy"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "reattach-to-user-namespace"
brew "sqlite"
brew "starship"
brew "stow"
brew "the_silver_searcher"
brew "tmux"
brew "toilet"
brew "wget"
brew "zoxide"


# Apps, fonts, plug-ins
cask "visual-studio-code"
cask "alt-tab"
cast "font-victor-mono"
cast "kitty"
cast "raycast"
cast "iina"


# Mac App Store (MAS) - Previously downloaded or paid software
mas "com.acqualia.soulver", id: 413965349
